{
  "title" : "Hablas Ingles?",
  "location": "Mexico City Airport",
  "date": "10/14/17",
  "blogText":[
		{
      "text" : "I touched down, after having way too much orange juice, chips, and salsa. I then followed the crowd to the security checkout. In Mexico City Airport the international terminals are not linked, so if your connecting flight is in a different terminal you have to go through security again in the next terminal."
		},
    {
      "text": "The lady working at the Aeromexico service desk spoke English very softly, but enough for me to figure out that I was I needed to get to Terminal 1 (and apparently I was in Terminal 2). She gave me some directions to find a bus. I tried to follow them and got lost for about 30 minutes, so I used my broken spanish to talk to two or three others and found a way to the bus."
    },
    {
      "text": "I was impressed, even the taxi company representatives were willing to point me in the correct direction. I was very cautious talking to people, but all of the officials seemed to want to help me."
    },
    {
      "text": "I finally got to security for Terminal 1 about 12 hours before my flight. They aren’t supposed to let you in more than a few hours before your flight but I think the guy felt sorry for me, so I got in. I then walked around for a few more hours trying to find a place to sleep. Fortunately I had talk and text in Mexico City, so I was able to reach out to my girlfriend and not only get important information, but talk to someone casually in English, which was a good break from the enjoyable but mentally taxing puzzle of spanish."
    },
    {
      "text": "I was woken up a few hours later to tons of racket and loud announcements over the speaker system next to which I was sleeping. I then moved down the hall to find a quieter terminal where I could get some sleep. Once I found a sleeping position (it wasn’t exactly laying down, but I could fall into unconsciousness for a few hours at a time) it wasn’t so bad. Sleeping at an airport is a bit of an art. But once you find that sleeping position its manageable."
    },
    {
      "text": "I would like to comment on how nice everyone was at the Mexico City airport. While my instincts were to not trust anyone, including police officers, I found the people of Mexico City to be very accommodating. After figuring out I didn’t know much spanish, people always spoke English as best they could. Several people who could tell I was lost asked me if I needed help. At one point I was shaken awake because an airline official thought I was about to sleep through my flight. There were many people about to miss flights, but all the officials were doing everything they could to help them get to their flight. We can be quite individualistic, so it was refreshing to see people helping others."
    },
		{
			"text": "Happy I brought",
			"list": {
				"style": "bullet",
				"textItems":[
					{
						"text": "Google Translator with Spanish offline"
					},
          {
            "text": "Transformer Pillow – Goes between regular and neck pillow"
          },
          {
            "text": "Small Throw/Travel Blanket"
          },
          {
            "text": "Food from home country – Good to have something familiar and mobile, I took a bag of Granola and Go-Go apple sauce"
          }
				]
			}
		},
		{
			"text": "Wish I had brought",
			"list": {
				"style": "bullet",
				"textItems":[
          {
            "text": "Inflatable camping pad – Sleeping upright in the airport chair was far from ideal. It would be nice to have the option to sleep comfortably anywhere"
          }
				]
			}
		},
    {
      "text": "In retrospect, my extremely long layover may have been a blessing in disguise. While I was exhausted, I was not pressed for time. And in a place like Mexico City Airport, that is a good thing. Especially given my lack on confidence with spanish, if I only had my original layover I would have been a lot more stressed. There is something to be said for having a relaxed deadline, even if it does involve sleeping in an airport."
    }
	],
  "images": {
    "main": "https://s3.us-east-2.amazonaws.com/jeff.ski/blog/chile/img/mexicocityAirportDepart.jpg",
    "slideshow": [
      {
        "rel": "Main Post Img"
      }
    ]
  },
  "links": [
    {
      "rel": "self",
      "href": "https://s3.us-east-2.amazonaws.com/jeff.ski/blog/chile/2017_10_14_1.json"
    }
  ]
}